[Common]
FolderName=Wiz.Picture.md
AppName=MarkdownPictureAttachment
AppName_2052=Markdown图片附件
AppName_1028=Markdown圖片附件
AppGUID={a4392f65-081b-4684-9227-2bcc1ec1f159}
AppType=Tools
AppVersion=1.0
PluginCount=8
SupportVersion=2

[Plugin_0]
Caption=LoadPicture
Caption_2052=加载图片附件
Caption_1028=加載圖片附件
GUID={2578637d-e3be-4015-9797-ae58da03cafa}
ScriptFileName=MdPicGlobal.js
Type=Global

[Plugin_1]
MenuType=DocumentCtrl
Caption=Download All Attachments
Caption_2052=下载所有附件
Caption_1028=下载所有附件
GUID={6653a790-f8cd-4fe0-bbc7-61c1232639b8}
ScriptFileName=DocumentCtrlDownloadAll.js
Type=ExecuteScript

[Plugin_2]
MenuType=CategoryCtrlFolders
Caption=Download All Attachments
Caption_2052=下载所有附件
Caption_1028=下载所有附件
GUID={fc7dbfcf-878e-4a10-a66c-c6c1b4fd6b54}
ScriptFileName=CategoryCtrlFoldersDownloadAll.js
Type=ExecuteScript

[Plugin_3]
MenuType=DocumentCtrl
Caption=Download All Picture Attachments
Caption_2052=下载所有图片附件
Caption_1028=下载所有圖片附件
GUID={2f1f0868-4d01-47f8-9364-b975059e2655}
ScriptFileName=DocumentCtrlDownloadAllPicture.js
Type=ExecuteScript

[Plugin_4]
MenuType=CategoryCtrlFolders
Caption=Download All Picture Attachments
Caption_2052=下载所有图片附件
Caption_1028=下载所有圖片附件
GUID={bdabf67b-4ab4-49a8-9ed4-38997879b3f2}
ScriptFileName=CategoryCtrlFoldersDownloadAllPicture.js
Type=ExecuteScript

[Plugin_5]
MenuType=CategoryCtrlAllFolders
Caption=Download All Attachments
Caption_2052=下载所有附件
Caption_1028=下载所有附件
GUID={9fe39539-b7cf-4da8-b2f6-f7cf8dbb7f5d}
ScriptFileName=CategoryCtrlAllFoldersDownloadAll.js
Type=ExecuteScript

[Plugin_6]
MenuType=CategoryCtrlAllFolders
Caption=Download All Picture Attachments
Caption_2052=下载所有图片附件
Caption_1028=下载所有圖片附件
GUID={6cfac96c-ee9e-4e26-828c-a6469f379aa9}
ScriptFileName=CategoryCtrlAllFoldersDownloadAllPicture.js
Type=ExecuteScript

[Plugin_7]
MenuType=DocumentCtrl
Caption=Set Document URL
Caption_2052=设置文档URL
Caption_1028=設定文件URL
GUID={cdf01707-4d29-4a91-a270-7b866227864f}
ScriptFileName=DocumentCtrlSetURL.js
Type=ExecuteScript

[Strings]

btnDownloadAll=Download All Attachments
btnDownloadAll_2052=下载所有附件
btnDownloadAll_1028=下載所有附件

btnDownloadAllPicture=Download All Picture Attachments
btnDownloadAllPicture_2052=下载所有图片附件
btnDownloadAllPicture_1028=下載所有圖片附件

strAllDownloaded=All Attachments are already downloaded
strAllDownloaded_2052=所有附件全部下载完毕
strAllDownloaded_1028=所有附件全部下載完畢

strAllPictureDownloaded=All Picture Attachments are already downloaded
strAllPictureDownloaded_2052=所有图片附件全部下载完毕
strAllPictureDownloaded_1028=所有圖片附件全部下載完畢

labelNumberOfSelectedDocuments=Number of Selected Documents: 
labelNumberOfSelectedDocuments_2052=选中的文档数目：
labelNumberOfSelectedDocuments_1028=選中的文件數目：

labelNumberOfSelectedAttachments=Number of Selected Attachments: 
labelNumberOfSelectedAttachments_2052=选中的附件数目：
labelNumberOfSelectedAttachments_1028=選中的附件數目：

labelNumberOfDownloadedAttachments=Number of Downloaded Attachments: 
labelNumberOfDownloadedAttachments_2052=本次下载的附件数目：
labelNumberOfDownloadedAttachments_1028=本次下載的附件數目：

labelNumberOfFailedAttachments=Number of Failed Attachments: 
labelNumberOfFailedAttachments_2052=本次下载失败的附件数目：
labelNumberOfFailedAttachments_1028=本次下載失敗的附件數目：

labelSplash=Waiting for fetching Documents Data
labelSplash_2052=稍后，正在获取文档数据。。。
labelSplash_1028=稍後，正在獲取文件資料。。。

log0=has 0 attachment
log0_2052=没有附件
log0_1028=沒有附件

log1=has already been downloaded
log1_2052=附件已下载
log1_1028=附件已下載

log2=Downloading
log2_2052=开始下载
log2_1028=開始下載

log3=Failed to download
log3_2052=无法下载
log3_1028=無法下載

log4=is not a picture
log4_2052=不是图片附件
log4_1028=不是圖片附件

hintAllDownload=All Selected Attachments are downloaded
hintAllDownload_2052=所有附件均下载完成
hintAllDownload_1028=所有附件均下載完成

strNoSelectedDocuments=No selected doument
strNoSelectedDocuments_2052=没有选中文档
strNoSelectedDocuments_1028=沒有選中文檔

strSelectOnlyOne=Please select only one document
strSelectOnlyOne_2052=请只选中一个文档
strSelectOnlyOne_1028=請只選中一個文檔

strSetDocumentURL=Set Document URL
strSetDocumentURL_2052=设置文档URL
strSetDocumentURL_1028=設定文檔URL

strSetURLHint1=Once set, you cannot removed it, but you can replace it with another valid URL address
strSetURLHint1_2052=设置文档URL后，文档URL不能够被清空，但可以将其修改为其他有效的URL地址
strSetURLHint1_1028=設定文檔URL後，文檔URL不能夠被清空，但可以將其修改為其他有效的URL地址

strSetURLHint2=Cannot remove URL, you can only modify it with a valid URL address
strSetURLHint2_2052=不能够清空文档URL，但可以将其修改为其他有效的URL地址
strSetURLHint2_1028=不能夠清空文檔URL，但可以將其修改為其他有效的URL地址

[Config]
;如果是1，则自动下载使用到的图片附件；如果是0，则不自动下载，可以通过工具栏中的“下载所有图片附件”手动下载
AutoDownloadPicture=0